balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1946.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0xff" edc:name="RD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEG0" edc:desc="" edc:mask="0x1" edc:name="SEG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1" edc:desc="" edc:mask="0x1" edc:name="SEG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2" edc:desc="" edc:mask="0x1" edc:name="SEG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG3" edc:desc="" edc:mask="0x1" edc:name="SEG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG4" edc:desc="" edc:mask="0x1" edc:name="SEG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG5" edc:desc="" edc:mask="0x1" edc:name="SEG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG6" edc:desc="" edc:mask="0x1" edc:name="SEG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG7" edc:desc="" edc:mask="0x1" edc:name="SEG7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="P2D" edc:desc="" edc:mask="0x1" edc:name="P2D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2C" edc:desc="" edc:mask="0x1" edc:name="P2C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2B" edc:desc="" edc:mask="0x1" edc:name="P2B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3C" edc:desc="" edc:mask="0x1" edc:name="P3C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3B" edc:desc="" edc:mask="0x1" edc:name="P3B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1C" edc:desc="" edc:mask="0x1" edc:name="P1C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1B" edc:desc="" edc:mask="0x1" edc:name="P1B" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SDO2" edc:desc="" edc:mask="0x1" edc:name="SDO2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI2" edc:desc="" edc:mask="0x1" edc:name="SDI2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK2" edc:desc="" edc:mask="0x1" edc:name="SCK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nSS2" edc:desc="" edc:mask="0x1" edc:name="nSS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SDA2" edc:desc="" edc:mask="0x1" edc:name="SDA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCL2" edc:desc="" edc:mask="0x1" edc:name="SCL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0xff" edc:name="RE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VLCD1" edc:desc="" edc:mask="0x1" edc:name="VLCD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD2" edc:desc="" edc:mask="0x1" edc:name="VLCD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD3" edc:desc="" edc:mask="0x1" edc:name="VLCD3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COM0" edc:desc="" edc:mask="0x1" edc:name="COM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COM1" edc:desc="" edc:mask="0x1" edc:name="COM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COM2" edc:desc="" edc:mask="0x1" edc:name="COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COM3" edc:desc="" edc:mask="0x1" edc:name="COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG31" edc:desc="" edc:mask="0x1" edc:name="SEG31" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="P2D" edc:desc="" edc:mask="0x1" edc:name="P2D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2C" edc:desc="" edc:mask="0x1" edc:name="P2C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2B" edc:desc="" edc:mask="0x1" edc:name="P2B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3C" edc:desc="" edc:mask="0x1" edc:name="P3C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3B" edc:desc="" edc:mask="0x1" edc:name="P3B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1C" edc:desc="" edc:mask="0x1" edc:name="P1C" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1B" edc:desc="" edc:mask="0x1" edc:name="P1B" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2A" edc:desc="" edc:mask="0x1" edc:name="P2A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CCP2" edc:desc="" edc:mask="0x1" edc:name="CCP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
