balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1946.PIC
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="DACCON0" edc:desc="Voltage Reference Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="DACCON0" edc:nzwidth="8" edc:por="000-00-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="DAC1 Negative Source Select bits" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="DAC1 Voltage Output Enable bit" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACLPS" edc:desc="DAC 1 Low Power Voltage State Select bit" edc:mask="0x1" edc:name="DACLPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="DAC 1 Enable bit" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="Voltage Reference Control Register 2" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON0" edc:desc="SR Latch Control Register 0" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPR" edc:desc="Pulse Reset Input of the SR Latch" edc:mask="0x1" edc:name="SRPR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRPS" edc:desc="Pulse Set Input of the SR Latch" edc:mask="0x1" edc:name="SRPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRNQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRNQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK0" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK1" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK2" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRLEN" edc:desc="SR Latch Enable bit" edc:mask="0x1" edc:name="SRLEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SRCLK" edc:desc="SR Latch Clock divider bits" edc:mask="0x7" edc:name="SRCLK" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON1" edc:desc="SR Latch Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON1" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRRC1E" edc:desc="SR Latch C1 Reset Enable bit" edc:mask="0x1" edc:name="SRRC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRC2E" edc:desc="SR Latch C2 Reset Enable bit" edc:mask="0x1" edc:name="SRRC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRCKE" edc:desc="SR Latch Reset Clock Enable bit" edc:mask="0x1" edc:name="SRRCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRPE" edc:desc="SR Latch Peripheral Reset Enable bit" edc:mask="0x1" edc:name="SRRPE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC1E" edc:desc="SR Latch C1 Set Enable bit" edc:mask="0x1" edc:name="SRSC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC2E" edc:desc="SR Latch C2 Set Enable bit" edc:mask="0x1" edc:name="SRSC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSCKE" edc:desc="SR Latch Set Clock Enable bit" edc:mask="0x1" edc:name="SRSCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSPE" edc:desc="SR Latch Peripheral Set Enable bit" edc:mask="0x1" edc:name="SRSPE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APFCON" edc:desc="Alternate Pin Function Control Register" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APFCON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P1BSEL" edc:desc="CCP1 PWM B output pin selection bit" edc:mask="0x1" edc:name="P1BSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1CSEL" edc:desc="CCP1 PWM C output  Pin Selection" edc:mask="0x1" edc:name="P1CSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2SEL" edc:desc="CCP2 input/Output Pin Selection" edc:mask="0x1" edc:name="CCP2SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2BSEL" edc:desc="CCP2 PWM B Output Pin Selection" edc:mask="0x1" edc:name="P2BSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2CSEL" edc:desc="CCP2 PWM C Output Pin Selection" edc:mask="0x1" edc:name="P2CSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2DSEL" edc:desc="CCP2 PWM D output pin selection bit" edc:mask="0x1" edc:name="P2DSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3BSEL" edc:desc="CCP3 PWM B output pin selection bit" edc:mask="0x1" edc:name="P3BSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3CSEL" edc:desc="CCP3 PWM C Output pin selection bit" edc:mask="0x1" edc:name="P3CSEL" edc:nzwidth="1">
                <edc:SFRFieldSemantic edc:desc="P3C function is on RE3/P3C/COM0" edc:when=""/>
                <edc:SFRFieldSemantic edc:desc="P3C function is on RD3/P3C/SEG3" edc:when=""/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM3CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM3CON0" edc:nzwidth="0x8" edc:por="0000-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C3SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C3SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C3HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3SP" edc:desc="Comparator Speed/Power Select bit" edc:mask="0x1" edc:name="C3SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C3POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="C3OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C3ON" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C3ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
