balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1946.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LATG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="LATG" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG4" edc:desc="" edc:mask="0x1" edc:name="LATG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG5" edc:desc="" edc:mask="0x1" edc:name="LATG5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATG" edc:desc="" edc:mask="0xff" edc:name="LATG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBP" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBP0" edc:desc="" edc:mask="0x1" edc:name="IOCBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP1" edc:desc="" edc:mask="0x1" edc:name="IOCBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP2" edc:desc="" edc:mask="0x1" edc:name="IOCBP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP3" edc:desc="" edc:mask="0x1" edc:name="IOCBP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:mask="0xff" edc:name="IOCBP" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBN" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBN0" edc:desc="" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN1" edc:desc="" edc:mask="0x1" edc:name="IOCBN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN2" edc:desc="" edc:mask="0x1" edc:name="IOCBN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN3" edc:desc="" edc:mask="0x1" edc:name="IOCBN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:mask="0xff" edc:name="IOCBN" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBF" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBF0" edc:desc="" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF1" edc:desc="" edc:mask="0x1" edc:name="IOCBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF2" edc:desc="" edc:mask="0x1" edc:name="IOCBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF3" edc:desc="" edc:mask="0x1" edc:name="IOCBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBF" edc:desc="" edc:mask="0xff" edc:name="IOCBF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELF" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSF0" edc:desc="" edc:mask="0x1" edc:name="ANSF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF1" edc:desc="" edc:mask="0x1" edc:name="ANSF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF2" edc:desc="" edc:mask="0x1" edc:name="ANSF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF3" edc:desc="" edc:mask="0x1" edc:name="ANSF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF4" edc:desc="" edc:mask="0x1" edc:name="ANSF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF5" edc:desc="" edc:mask="0x1" edc:name="ANSF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF6" edc:desc="" edc:mask="0x1" edc:name="ANSF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSF7" edc:desc="" edc:mask="0x1" edc:name="ANSF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELF" edc:desc="" edc:mask="0xff" edc:name="ANSELF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
